documentation.html
<!doctype html>
<html lang="en">
<head>
<title>ECE 408 - Final Project: Shit They Should Have Told Us</title>
<!-- 2016-12-01 Thu 21:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Rishi Thakkar">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">ECE 408 - Final Project: Shit They Should Have Told Us</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Documentation</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Global Variables</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>int <code>xdims</code>[] = {sample size, num rows, num cols, num channels}
</li>
<li>int <code>rdims</code>[] = {sample size, num digits};
<ul class="org-ul">
<li>reference samples -&#x2014;&gt; it will be used to check if the output is correct
</li>
</ul>
</li>
<li>Convolution Layer
<ul class="org-ul">
<li>int example[] = {rows, cols, num input feature maps, num output feature maps};
</li>
<li>int <code>conv1dims</code>[] = {5, 5, 1, 32};
</li>
<li>int <code>conv2dims</code>[] = {5, 5, 32, 64};
</li>
</ul>
</li>
<li>Sub-sampling
<ul class="org-ul">
<li>int example[] = {num of input data, num of output data};
</li>
<li>int <code>fc1dims</code>[]   = {1024, 128};
</li>
<li>int <code>fc2dims</code>[]   = {128, 10};
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Forward Operation</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Inputs</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>float * <code>x</code> = input array
</li>
<li>float * <code>conv1</code> = mask for first convolution layer
</li>
<li>float * <code>conv2</code> = mask for second convolution layer
</li>
<li>float * <code>fc1</code> = full connections 1 weights
</li>
<li>float * <code>fc2</code> = full connections 2 weights
</li>
<li>int * <code>out</code> = output array
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Structure and Local Variables</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>First Convolution Layer<br ><div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>int <code>admins</code>[] = {sample size, conv 1 output rows, conv 1 output cols, conv 1 output feature maps};
<ul class="org-ul">
<li>output rows = num input rows - mask rows + 1
</li>
<li>output cols = num input cols - mask cols + 1
</li>
</ul>
</li>
<li>float * <code>a</code> = output of first convolution layer
</li>
<li><b><b><b><b>*</b></b></b></b> call to first convolution layer <b><b><b><b>*</b></b></b></b>
</li>
<li><b><b><b><b>*</b></b></b></b> call to relu <b><b><b><b>*</b></b></b></b>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>First Average Pool<br ><div class="outline-text-5" id="text-1-2-2-2">
<ul class="org-ul">
<li>int <code>poolSize</code> = reduction factor &#x2014;&gt; same one used for all average pools
</li>
<li>int <code>bdims</code>[] = {sample size, avg. pool 1 output rows, avg. pool 1 ouput cols, avg. pool 1 output feature maps};
<ul class="org-ul">
<li>output rows and cols are reduced by a factor of pool size from the con 1 output rows and cols
</li>
<li>avg. pool 1 output feature maps = conv 1 output feature maps
</li>
</ul>
</li>
<li>float * <code>b</code> = output of first average pool
</li>
<li><b><b><b><b>*</b></b></b></b> call to first average pool <b><b><b><b>*</b></b></b></b>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-2-3" name="sec-1-2-2-3"></a>Second Convolution Layer<br ><div class="outline-text-5" id="text-1-2-2-3">
<ul class="org-ul">
<li>int <code>cdims</code> = {sample size, conv 2 output rows, con 2 output cols, conv 2 output feature maps};
<ul class="org-ul">
<li>output rows = num input rows - mask rows + 1
</li>
<li>output cols = num input cols - mask cols + 1
</li>
</ul>
</li>
<li>float * <code>c</code> = output of second convolution
</li>
<li><b><b><b><b>*</b></b></b></b> call to second convolution layer <b><b><b><b>*</b></b></b></b>
</li>
<li><b><b><b><b>*</b></b></b></b> call to relu <b><b><b><b>*</b></b></b></b>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-2-4" name="sec-1-2-2-4"></a>Second Average Pool<br ><div class="outline-text-5" id="text-1-2-2-4">
<ul class="org-ul">
<li>int <code>ddims</code>[] = {sample size, avg. pool 2 output rows, avg. pool 2 ouput cols, avg. pool 2 output feature maps};
</li>
<li>float * <code>d</code>  = output of second average pool
</li>
<li><b><b><b><b>*</b></b></b></b> call to second average pool <b><b><b><b>*</b></b></b></b>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-2-5" name="sec-1-2-2-5"></a>First Fully Connected Layer<br ><div class="outline-text-5" id="text-1-2-2-5">
<ul class="org-ul">
<li>int <code>ddims2</code>[] = {sample size, rows*cols*feature maps};
</li>
<li>int <code>edims</code>[] = {sample size, num of output connections for fc1};
</li>
<li>float * <code>e</code> = output of fully connected layer 1
</li>
<li><b><b><b><b>*</b></b></b></b> call to first fully connected layer 1 <b><b><b><b>*</b></b></b></b>
</li>
<li><b><b><b><b>*</b></b></b></b> call to relu <b><b><b><b>*</b></b></b></b>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-2-6" name="sec-1-2-2-6"></a>Second Fully Connected Layer and Gaussian Layer<br ><div class="outline-text-5" id="text-1-2-2-6">
<ul class="org-ul">
<li>int <code>fdims</code>[] = {sample size, num of output connections for fc2};
</li>
<li>float * <code>f</code> = output of fully coonected layer 2
</li>
<li><b><b><b><b>*</b></b></b></b> call to first fully connected layer 2 <b><b><b><b>*</b></b></b></b>
</li>
<li><b><b><b><b>*</b></b></b></b> call to args max (Gaussian layer) <b><b><b><b>*</b></b></b></b> 
</li>
<li>And now we know what you wrote
</li>
</ul>
</div>
</li></ol>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Documentation</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Global Variables</a></li>
<li><a href="#sec-1-2">1.2. Forward Operation</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Rishi Thakkar</p>
<p class="date">Created: 2016-12-01 Thu 21:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 9.0)</p>
</div>
</footer>
</body>
</html>
